FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Comment>Объект по которому производится отображение настраиваемых вариантов отчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяНастройка</Name>
					<Comment>Пользовательская настройка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузкиПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/НазначениеПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НазначениеПравИНастроек</Name>
			<Comment>Определяют уровень применимости права / настройки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
					<Comment>Значение права определяется для компании в целом (всей информационной базы)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
					<Comment>Значение права определяется для каждой организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Значение права определяется для каждого подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Значение права определяется для каждого пользователя</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыПравДляСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПравДляСправочников</Name>
			<Comment>Перечисление видов прав для справочников</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Редактирование</Name>
					<Comment>Возможность редактирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеПоГруппам</Name>
					<Comment>Возможность редактирования по группам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чтение</Name>
					<Comment>Возможность чтения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетДоступа</Name>
					<Comment>Нет доступа</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ВариантыОтчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьОграничениеТипа()
	
	Если Объект.ПользовательскаяНастройка = Истина Тогда
		Элементы.НазначениеДоступа.Доступность       = Ложь;
		Элементы.ОбъектДоступа.Доступность           = Ложь;
		Элементы.ОбъектДоступа.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.НазначениеДоступа.Доступность       = Истина;
		Элементы.ОбъектДоступа.Доступность           = Истина;
		Элементы.ОбъектДоступа.ОтметкаНезаполненного = Истина;
		Если Объект.НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Организация") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Организации");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ИначеЕсли Объект.НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Подразделение") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ИначеЕсли Объект.НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Пользователь") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		Иначе
			Элементы.ОбъектДоступа.Доступность           = Ложь;
			Элементы.ОбъектДоступа.ОтметкаНезаполненного = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если обПраво("ПроверкаДоступаКСправочникамИДокументам") Тогда
		СправочникИмя = Метаданные.Справочники.ВариантыОтчетов.Имя;
		ПравоДоступа = обПраво("Право доступа "+СправочникИмя);
		Если ПравоДоступа=Перечисления.ВидыПравДляСправочников.НетДоступа Тогда
			Отказ=Истина;
			Возврат;
		ИначеЕсли ПравоДоступа=Перечисления.ВидыПравДляСправочников.Чтение Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПользовательскаяНастройка = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ОшибкаОткрытия = НСтр("ru = 'Новый вариант отчета можно создать только из формы отчета'");
		Возврат;
	КонецЕсли;
	
	Если обПраво("РазрешитьРедактироватьОбщиеВариантыОтчетов") Тогда
		Элементы.НазначениеДоступа.Доступность         = Истина;
		Элементы.ОбъектДоступа.Доступность             = Истина;
		Элементы.ПользовательскаяНастройка.Доступность = Истина;
	ИначеЕсли Объект.Автор = ПараметрыСеанса.Пользователь И Объект.ПользовательскаяНастройка Тогда
		Элементы.НазначениеДоступа.Доступность         = Ложь;
		Элементы.ОбъектДоступа.Доступность             = Ложь;
		Элементы.ПользовательскаяНастройка.Доступность = Ложь;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Объект.ЭтоПредопределенный Тогда
		Элементы.ГруппаДоступности.Доступность = Ложь;
		Элементы.ПользовательскаяНастройка.Доступность = Ложь;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВариантЗагрузкиПериода.СписокВыбора;
	Для Каждого ТекЭлемент Из ВариантСтандартногоПериода Цикл
		
		ИмяЭлемента = ПолучитьПолноеИмяПредопределенногоЗначения(ТекЭлемент);
		Если ИмяЭлемента = "ВариантСтандартногоПериода.ПроизвольныйПериод" Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(ПолучитьПолноеИмяПредопределенногоЗначения(ТекЭлемент), Строка(ТекЭлемент));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПустаяСтрока(ОшибкаОткрытия) Тогда
		Если Объект.Ссылка.Пустая() Тогда
			Отказ = Истина;
		Иначе
			ТолькоПросмотр = Истина;
		КонецЕсли;
		Предупреждение(ОшибкаОткрытия);
	КонецЕсли;
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МногострочныйТекст   = Объект.Описание;
	
	ТекстВведен = ВвестиСтроку(МногострочныйТекст, НСтр("ru = 'Описание'"),, Истина);
	
	Если ТекстВведен Тогда
		Объект.Описание = МногострочныйТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеДоступаПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскаяНастройкаПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры
